{
  "language": {
    "english": "Englisch",
    "german": "Deutsch"
  },
  "application": {
    "title": "M152",
    "nav": "Navigation"
  },
  "general": {
    "translation-title": "Übersetzung",
    "translation-description": "Diese Applikation/Webseite wurde auf Deutsch geschrieben. Alle anderen Sprachen, welche zur Verfügung stehen wurden nicht von Menschen übersetzt und können deswegen Übersetzungsfehler beinhalten."
  },
  "navigation": {
    "home": "Home",
    "timeline": "Zeitlinie",
    "imprint": "Impressum",
    "fileformats": "Datei Formate",
    "animations": "Animationen"
  },
  "owner": {
    "name": "Michael Baumberger",
    "address": "Via Calundis, 39",
    "city": "7013 Domat/Ems",
    "country": "Schweiz",
    "email": "michael_baumberger@gmx.ch",
    "instagram": {
      "description": "Dies sind alles Bilder, welche von mir selber aufgenommen wurden. Falls du weitere Bilder von mir sehen möchtest, klick auf den unten stehenden Link.",
      "name": "michi_009"
    }
  },
  "impress": {
    "contact-address-title": "Kontakt-Adresse",
    "email-title": "E-Mail:",
    "disclaimer-of-liability-title": "Haftungsausschluss",
    "disclaimer-of-liability-1": "Der Autor übernimmt keinerlei Gewähr hinsichtlich der inhaltlichen Richtigkeit, Genauigkeit, Aktualität, Zuverlässigkeit und Vollständigkeit der Informationen.",
    "disclaimer-of-liability-2": "Haftungsansprüche gegen den Autor wegen Schäden materieller oder immaterieller Art, welche aus dem Zugriff oder der Nutzung bzw. Nichtnutzung der veröffentlichten Informationen, durch Missbrauch der Verbindung oder durch technische Störungen entstanden sind, werden ausgeschlossen.",
    "disclaimer-of-liability-3": "Alle Angebote sind unverbindlich. Der Autor behält es sich ausdrücklich vor, Teile der Seiten oder das gesamte Angebot ohne besondere Ankündigung zu verändern, zu ergänzen, zu löschen oder die Veröffentlichung zeitweise oder endgültig einzustellen.",
    "disclaimer-of-liability-for-links-title": "Haftungsausschluss für Links",
    "disclaimer-of-liability-for-links": "Verweise und Links auf Webseiten Dritter liegen ausserhalb unseres Verantwortungsbereichs. Es wird jegliche Verantwortung für solche Webseiten abgelehnt. Der Zugriff und die Nutzung solcher Webseiten erfolgen auf eigene Gefahr des jeweiligen Nutzers.",
    "copyrights-title": "Urheberrechte",
    "copyrights": "Die Urheber- und alle anderen Rechte an Inhalten, Bildern, Fotos oder anderen Dateien auf dieser Website, gehören ausschliesslich dem oben genannten Besitzer oder den speziell genannten Rechteinhabern. Für die Reproduktion jeglicher Elemente ist die schriftliche Zustimmung des Urheberrechtsträgers im Voraus einzuholen.",
    "source-title": "Quelle:",
    "source": "SwissAnwalt"
  },
  "file-formats": {
    "title": "Dateiformate",
    "description": "Hier wird gezeigt, wie man verschiedene Dateiformate in HTML5 einbindet.",
    "video": {
      "title": "Videoformat",
      "description": "Hier wurde ein Video eingebunden. Unter dem Video sieht man den source code mit welchem das video eingebunden wurde.",
      "mp4": "Das ist der source tag um ein MP4 einzubinden, welches gemacht wurde.",
      "ogg": "Dies wäre der source tag um ein ogg einzubinden.",
      "webm": "Dies wäre der source tag um ein webm einzubinden.",
      "tag": "Dies ist der Video Tag und in diesem wurden die Klasse 'p-justify-center' verwendet um das Video zu Zentrieren. Dazu wurde der Tag poster verwendet um ein Vorschaubild des Videos einzubinden. Mit 'autoplay='autoplay', 'loop='true' wird das video sobald es geladen wurde automatisch abgespielt und es wird immer wieder wiederholt."
    },
    "images": {
      "title": "Bilder",
      "description": "Hier werden einige Bildformate vorgestellt und gezeigt wie Bilder in HTML5 eingebunden werden.",
      "tag": "Dies ist der Tag um ein Bild ganz einfach einzubinden."
    },
    "sound": {
      "title": "Musikdateien",
      "description": "Hier wurde eine Musikdatei in HTML5 eingebunden. Darunter ist aufgezeigt, wie die Datei eingebunden wurde.",
      "tag": "audio: Dies ist der Tag um eine MP3 Datei einzubinden.",
      "controls": "control: Dies muss gesetzt sein, damit der User die Wiedergabe laufen/stoppen lassen kann und die Lautstärke einstellen.",
      "src": "src: Die ist der Tag um die Source, also die Datei, anzugeben.",
      "notCompatible": "Dies wird angezeigt, wenn ein Browser die Musikwiedergabe nicht unterstützt."
    }
  },
  "animations": {
    "title": "Animationen",
    "css3": {
      "title": "CSS3 Animationen",
      "description": "Hier wird gezeigt wie CSS3 Animationen gemacht werden.",
      "letsGO": "Let's GOO!!"
    },
    "svg": {
      "title": "SVG Animationen",
      "description": "Hier wird gezeigt wie SVG Animationen gemacht werden."
    },
    "angular": {
      "title": "Angular Animationen",
      "description": "Um die Angular Animation zu sehen, drücken Sie auf den Titel der Webseite 'M152'. Der Code welcher Benutzt wird ist unten aufgeführt."
    },
    "canvas": {
      "title": "HTML5 Canvas",
      "description": "Hier wurde eine Uhr in HTML5 Canvas eingebunden.",
      "html-integration": "Im HTML wurde das Canvas definiert.",
      "typescipt-integration": "Dies ist der Typescript/Javascript Code welcher für die Uhr verwendet wurde."
    }
  }
}
