{
  "language": {
    "english": "Englisch",
    "german": "Deutsch"
  },
  "application": {
    "title": "M152",
    "nav": "Navigation"
  },
  "general": {
    "translation-title": "Übersetzung",
    "translation-description": "Diese Applikation/Webseite wurde auf Deutsch geschrieben. Alle anderen Sprachen, welche zur Verfügung stehen wurden nicht von Menschen übersetzt und können deswegen Übersetzungsfehler beinhalten."
  },
  "navigation": {
    "home": "Home",
    "concept": "Konzept",
    "timeline": "Zeitlinie",
    "imprint": "Impressum",
    "fileformats": "Datei Formate",
    "animations": "Animationen",
    "github": "Github",
    "pwa": "Progressive Web App",
    "mockup": "Mockup",
    "styleguide": "Style Guide",
    "licenses": "Lizenzen",
    "testing": "Testen",
    "reflection": "Reflexion"
  },
  "owner": {
    "name": "Michael Baumberger",
    "address": "Via Calundis, 39",
    "city": "7013 Domat/Ems",
    "country": "Schweiz",
    "email": "michael_baumberger@gmx.ch",
    "instagram": {
      "description": "Dies sind alles Bilder, welche von mir selber aufgenommen wurden. Falls du weitere Bilder von mir sehen möchtest, klick auf den unten stehenden Link.",
      "name": "michi_009"
    }
  },
  "impress": {
    "contact-address-title": "Kontakt-Adresse",
    "email-title": "E-Mail:",
    "disclaimer-of-liability-title": "Haftungsausschluss",
    "disclaimer-of-liability-1": "Der Autor übernimmt keinerlei Gewähr hinsichtlich der inhaltlichen Richtigkeit, Genauigkeit, Aktualität, Zuverlässigkeit und Vollständigkeit der Informationen.",
    "disclaimer-of-liability-2": "Haftungsansprüche gegen den Autor wegen Schäden materieller oder immaterieller Art, welche aus dem Zugriff oder der Nutzung bzw. Nichtnutzung der veröffentlichten Informationen, durch Missbrauch der Verbindung oder durch technische Störungen entstanden sind, werden ausgeschlossen.",
    "disclaimer-of-liability-3": "Alle Angebote sind unverbindlich. Der Autor behält es sich ausdrücklich vor, Teile der Seiten oder das gesamte Angebot ohne besondere Ankündigung zu verändern, zu ergänzen, zu löschen oder die Veröffentlichung zeitweise oder endgültig einzustellen.",
    "disclaimer-of-liability-for-links-title": "Haftungsausschluss für Links",
    "disclaimer-of-liability-for-links": "Verweise und Links auf Webseiten Dritter liegen ausserhalb unseres Verantwortungsbereichs. Es wird jegliche Verantwortung für solche Webseiten abgelehnt. Der Zugriff und die Nutzung solcher Webseiten erfolgen auf eigene Gefahr des jeweiligen Nutzers.",
    "copyrights-title": "Urheberrechte",
    "copyrights": "Die Urheber- und alle anderen Rechte an Inhalten, Bildern, Fotos oder anderen Dateien auf dieser Website, gehören ausschliesslich dem oben genannten Besitzer oder den speziell genannten Rechteinhabern. Für die Reproduktion jeglicher Elemente ist die schriftliche Zustimmung des Urheberrechtsträgers im Voraus einzuholen.",
    "source-title": "Quelle:",
    "source": "SwissAnwalt"
  },
  "file-formats": {
    "title": "Dateiformate",
    "description": "Hier wird gezeigt, wie man verschiedene Dateiformate in HTML5 einbindet.",
    "video": {
      "title": "Videoformat",
      "description": "Hier wurde ein Video eingebunden. Unter dem Video sieht man den source code mit welchem das video eingebunden wurde.",
      "mp4": "Das ist der source tag um ein MP4 einzubinden, welches gemacht wurde.",
      "ogg": "Dies wäre der source tag um ein ogg einzubinden.",
      "webm": "Dies wäre der source tag um ein webm einzubinden.",
      "tag": "Dies ist der Video Tag und in diesem wurden die Klasse 'p-justify-center' verwendet um das Video zu Zentrieren. Dazu wurde der Tag poster verwendet um ein Vorschaubild des Videos einzubinden. Mit 'autoplay='autoplay', 'loop='true' wird das video sobald es geladen wurde automatisch abgespielt und es wird immer wieder wiederholt."
    },
    "images": {
      "title": "Bilder",
      "description": "Hier werden einige Bildformate vorgestellt und gezeigt wie Bilder in HTML5 eingebunden werden.",
      "tag": "Dies ist der Tag um ein Bild ganz einfach einzubinden."
    },
    "sound": {
      "title": "Musikdateien",
      "description": "Hier wurde eine Musikdatei in HTML5 eingebunden. Darunter ist aufgezeigt, wie die Datei eingebunden wurde.",
      "tag": "audio: Dies ist der Tag um eine MP3 Datei einzubinden.",
      "controls": "control: Dies muss gesetzt sein, damit der User die Wiedergabe laufen/stoppen lassen kann und die Lautstärke einstellen.",
      "src": "src: Die ist der Tag um die Source, also die Datei, anzugeben.",
      "notCompatible": "Dies wird angezeigt, wenn ein Browser die Musikwiedergabe nicht unterstützt."
    }
  },
  "animations": {
    "title": "Animationen",
    "description": "Hier wird gezeigt wie verschiedene Arten von Animationen gemacht werden.",
    "css3": {
      "title": "CSS3 Animationen",
      "description": "Hier wird gezeigt wie CSS3 Animationen gemacht werden.",
      "letsGO": "Let's GOO!!"
    },
    "svg": {
      "title": "SVG Animationen",
      "description": "Hier wird gezeigt wie SVG Animationen gemacht werden."
    },
    "angular": {
      "title": "Angular Animationen",
      "description": "Um die Angular Animation zu sehen, drücken Sie auf den Titel der Webseite 'M152'. Der Code welcher Benutzt wird ist unten aufgeführt."
    },
    "canvas": {
      "title": "HTML5 Canvas",
      "description": "Hier wurde eine Uhr in HTML5 Canvas eingebunden.",
      "html-integration": "Im HTML wurde das Canvas definiert.",
      "typescript-integration": "Dies ist der Typescript/Javascript Code welcher für die Uhr verwendet wurde."
    }
  },
  "concept": {
    "title": "Konzept",
    "idea": {
      "title": "Idee",
      "description": "Die Idee ist es, das dies eine Webseite ist, welche dokumentiert, wie man etwas macht, best practices zeigt, oder unterschiede von Dingen erklärt."
    }
  },
  "calendar": {
    "settings": {
      "today": "Heute",
      "month": "Monat",
      "week": "Woche",
      "day": "Tag",
      "list": "Liste"
    },
    "entries": {
      "1": {
        "title": "Input Copyright"
      },
      "2": {
        "title": "Webseite planen"
      },
      "3": {
        "title": "Zeitplan erstellt"
      },
      "4": {
        "title": "OneNote Notizen erstellt"
      },
      "5": {
        "title": "Mockup zeichen (von Hand)"
      },
      "6": {
        "title": "Input SVG"
      },
      "7": {
        "title": "Webseite Grundgerüst erstellen"
      },
      "8": {
        "title": "Kalender für Zeitlinie erstellen"
      },
      "9": {
        "title": "Input ___"
      },
      "10": {
        "title": "Applikation Serverbereit gemacht"
      },
      "11": {
        "title": "Impressum erstellt"
      },
      "12": {
        "title": "Applikation erstes Mal hochgeladen und Fehler behoben"
      },
      "13": {
        "title": "Zeitplan überarbeitet"
      },
      "14": {
        "title": "Impressum auf English übersetzt"
      },
      "15": {
        "title": "Icons erstellt"
      },
      "16": {
        "title": "Fileformate Seite erstellt"
      },
      "17": {
        "title": "Fileformate Video eingebunden"
      },
      "18": {
        "title": "Fileformate Bilder eingebunden"
      },
      "19": {
        "title": "Fileformate Sound eingebunden"
      },
      "20": {
        "title": "Animations Angular eingebunden"
      },
      "21": {
        "title": "Animations CSS3 eingebunden"
      },
      "22": {
        "title": "Fileformate überarbeitet"
      },
      "23": {
        "title": "Animationen SVG eingebunden"
      },
      "24": {
        "title": "Animationen Angular eingebunden"
      },
      "25": {
        "title": "Animationen HTML5 Canvas eingebunden"
      },
      "26": {
        "title": "Sound laden Bug behoben"
      },
      "27": {
        "title": "Button zum Code anzeigen eingebaut"
      },
      "28": {
        "title": "Responsive ausser Canvas Uhr"
      },
      "29": {
        "title": "Zu PWA (Progressiv Web App) gemacht"
      },
      "30": {
        "title": "Kalender multilingual"
      },
      "31": {
        "title": "Buggs behoben"
      },
      "32": {
        "title": "Kalendar auf Tag klicken hinzugefügt"
      },
      "33": {
        "title": "Kalender Einträge Multilingual"
      },
      "34": {
        "title": "Mockup Seite erstellt"
      },
      "35": {
        "title": "HTML5 Canvas Uhr überarbeitet"
      },
      "36": {
        "title": "Style Guide integriert"
      },
      "37": {
        "title": "Lizenzen eingebaut"
      },
      "38": {
        "title": "Testen hinzugefügt"
      },
      "39": {
        "title": "Reflexion hinzugefügt"
      }
    }
  },
  "pwa": {
    "title": "Progressive Web App",
    "description": "Eine PWA (Progressive Web App) hat zahlreiche Merkmale, welche eine Native App auch hat. Progressive Web Apps sind meistens wie eine normale Webseite aufgebaut, also aus Html5, CSS3 und Javascript. Durch Service Worker wird die Offline-Funktionalität gewährleistet, indem der Service Worker die Seite cached. Das HTTPS-Protokoll ist vorgeschrieben, für die komunikation mit dem Webserver.",
    "functionality": {
      "title": "Funktionsweise",
      "description": "Eine Progressive Web App besucht man wie jede andere Webseite durch das Aufrufen der URL. Bei dem ersten Aufruf wird eine Service Worker im Browser 'installiert'. Dieser Cached alle Seiten, für welcher er bestimmt ist. Es gibt dazu eine Konfigurationsdatei in welcher der Entwickler sagen kann was gecached werden soll. Um die Webseite als App zu 'installieren' wird im Chrome Desktop Browser ein Icon in der Adressleiste angezeigt. Auf dem Handy kommt meistens ein Pop-Up oder eine Nachricht unten am Bildschirm, welche einem Aufmerksam macht, dass die Webseite als App hinzugefügt werden kann.",
      "serviceworker": {
        "title": "Service Worker",
        "description": "Ein Service Worker ist ein Javascript, dass im Browser im Hintergrund läuft und funktionen wie das Caching zur Offline-Verwendbarkeit zur Verfügung stellt."
      }
    },
    "characteristic": {
      "title": "Charakteristik",
      "description": "Neben den Eigenschften, welche eine normale Webseite zur Verfügung stellt, stellt eine Progressive Web App Sonderfunktionen bereit, welche normalerweise native Apps haben.",
      "installation": {
        "title": "Add-To-Homescreen/Installierbarkeit",
        "description": "Eine Progressive Web App kann durch eine 'Add-To-Homescreen' funktion zum Homescreen hinzugefügt werden. Dabei wird eine Manifest-Datei verwendet um zum Beispiel einen Splash Screen oder das Icon der App zu definieren."
      },
      "notification": {
        "title": "Push Benachrichtigungen",
        "description": "Eine Progressive Web App kann Push-Benachrichtigungen in ihrer Benachrichtigungsleiste anzeigen, was normalerweise nur Native Apps können und keine Webseiten."
      },
      "offline": {
        "title": "Offline-Funktionalität",
        "description": "Mit der Caching Funktionalität, welche der Service Worker bereitstellt kann die PWA auch offline zur Verfügung stehen. Bei einer Progressive Web App ohne Backend ist dies leicht, kommen jedoch einige Probleme hinzu."
      }
    },
    "advantages": {
      "title": "Vorteile",
      "cost_reduction": {
        "title": "Kostenreduktion",
        "description": "Anstelle von mehreren Apps (Android, IOS, Windows und Web) muss eine Progressive Web App nur einmal in einer Version entwickelt werden. Auch ein Vorteil ist, das an In-App-Käufen Google oder Apple nichts verdient."
      },
      "app_like": {
        "title": "App-like Design",
        "description": "Eine gute Progressive Web App hat die gleichen Designs wie eine Native App."
      },
      "hardware": {
        "title": "Hardwarezugriff",
        "description": "PWAs bieten ebenfalls die Möglichkeit, verschiedene native Funktionen zu implementieren. Es kann auf Sensorikdaten und Kameras zugegriffen werden oder Pushnotifications erstellt werden."
      },
      "release": {
        "title": "Vereinfachte Veröffentlichung",
        "description": "Progressive Web App können in den Google App Store, müssen jedoch nicht den langwierigen Veröffentlichungs Prozess von Google Play, Windows Phone Apps oder Apples App Store durchlaufen."
      },
      "offline": {
        "title": "Offline-Modus",
        "description": "Durch den Service Worker kann die Progressive Web App auch offline zur Verfügung stehen."
      },
      "performance": {
        "title": "Verbesserte Performance",
        "description": "PWA sind schneller als übliche Web-Apps. Davon profitieren Conversions, User Experience und Retention Rates."
      }
    }
  },
  "mockup": {
    "title": "Mockup",
    "description": "Die Erstellung eines Mockups oder besser gesagt eines Wireframes mit einem Tool ist leider Fehlgeschlagen. Dazu gab es mehrere Gründe. Das Tool oder besser gesagt die Tools welche ich herausgesucht habe, waren sehr schwer zu verstehen. Die Eingewöhnung und das erstellen des Tools als Mockup in Desktop und Mobile Version hätte viel zu viel Zeit gekostet. Ein weiterer Grund, welcher mir erst nach dem Zeichnen eingefallen ist, ist, dass ich das Mockup in der Webseite einbinden wollte und ich wüsste nicht wie ich ein Wireframe in einer Webseite einbinden könnte. Deshalt habe ich dieses Mockup gezeichnet. Die Mobile Version sieht sieht genau gleich aus, ausser natürlich das sie schmaler ist.",
    "libraries": {
      "title": "Bibliotheken",
      "description": "Ich habe einige Bibliotheken eingesetzt aber immer daran gedach, dass ich nicht alles mit Bibliotheken mache, denn dann müsste ich nichts mehr machen. Wenn ich alles mit Bibliotheken machen würde, könnte ich auch mit Wordpress arbeiten, Navigiere hier, Klicke da, installiere dieses Plugin, ziehe das dahin und setze die maximale Breite. Das wäre Wordpress. Unten verlinkt sind alle Bibliotheken, welche ich genutzt habe."
    },
    "others": {
      "title": "Anderes",
      "description": "Dazu habe ich noch andere Tools gebraucht. Einige sind fürs Programieren, Versions Kontrolle, andere wiederum für das Bereitstellen auf dem Server etc."
    }
  },
  "styleguide": {
    "title": "Style Guide",
    "primeng": {
      "title": "PrimeNG",
      "description": "Als Grundlage wird PrimeNG und deren Style eingesetzt. Der Link zu PrimeNG befindet sich im Mockup unter Bibliotheken."
    },
    "font": {
      "title": "Schrift",
      "description": "Die Schrift ist Open Sans v15 latin regular."
    },
    "logo": {
      "title": "Logo",
      "showIconSize": "Icon mit der Grösse: "
    },
    "primary_color": {
      "title": "Primäre Farbe",
      "description": "Die Primäre Farbe ist: #e91224."
    }
  },
  "licenses": {
    "title": "Lizenzen und Urheberrecht",
    "public_domain": {
      "title": "Public Domain",
      "description": "Public Domain, oder auf Deutsch Gemeinfreiheit, beschreibt Kunst, schriftstellerische Arbeiten und auch Computerprogramme, die nicht urheberrechtlich geschützt sind. Der Inhaber der Rechte kann auch selber einen Rechteverzicht leisten. Anschliessend gehören diese Werke ebenfalls zur Public Domain. Konkret bedeutet dass, das die Werke in der Public Domain frei genutzt werden können."
    },
    "fair_use": {
      "title": "Fair Use",
      "description": "Das Fair-Use-Prinzip bezieht sich auf die Benutzung von urheberrechtlich geschützen Materialien. Wie es der Name des Prinzips schon vermuten lässt, geht es darum die Nutzung und die Regelierung der Verwendung von geschützen Material möglichst fair (angemmesen) zu gestalten. Damit die Nutzung unter dem Fair-Use-Prinzip gültig gemacht werden kann, müssen einige Faktoren berücksichtigt werden:",
      "usage": {
        "title": "Zweck der Nutzung",
        "text": "Es muss unterschieden werden zwischen der Nutzung für Bildungszwecken oder kommerzieller Nutzung."
      },
      "cogyrights": {
        "title": "Art des Urheberrechts",
        "text": "Hier gilt es zu klären ob das Werk auf realen, nachweisbaren, Fakten basiert, oder von fiktiver Natur ist."
      },
      "amount_work": {
        "title": "Anteil im Verhältnis zum gesamten Werk",
        "text": "Die Nutzung von kleineren Textausschnitten aus dem Originalwerk ist in der Regel erlaubt. Bei längeren Abschnitten oder gar Absätzen kann es zu problemen führen. Auch hier gibt es aber ausnahmen, sofern die Anwendung noch mit Angemessen begründet werden kann."
      },
      "own_original": {
        "title": "Eigene Original Inhalte hinzufügen",
        "text": "Dem neuen Werk muss eine neue Bedeutung zugesprochen werden können. Hier gilt es das Verhältnis des geschützten Materials zum eigenen zugefügten Inhalt zu beachten."
      }
    }
  },
  "reflection": {
    "title": "Reflexion",
    "description": "Dieses Modul war definitiv eines der besseren Module. Leider muss ich sagen, dass einige Teile des Moduls einem Entwickler im dritten Lehrjahr bekannt sein müssen. Zum Beispiel wie man ein Bild oder ein Video in HTML5 einbindet. Andere wiederum, wie zum Beispiel Animationen, habe ich neu kennengelernt, da ich selten mit Animationen Arbeite im Geschäft. Dort sind es meistens Business Applikationen und der Kunde zahlt nicht dafür, dass sich die Webseite bewegt. Da einige Teile etwas 'leicht/langweilig' waren, konnte ich mir selber noch eine Challenge setzten und zwar, dass meine Webseite eine PWA (Progressive Web App) ist und somit offline zur Verfügung steht. Meine letzten Worte sind nur, dass mir das Modul sehr gut gefiehl auch wenn es viel Inhalt hat."
  },
  "testing": {
    "title": "Testen",
    "description": "Here are some tests described and results as to whether they work in different browsers.",
    "browser": {
      "chrome": "Chrome 83.0.4103.116",
      "firefox": "Firefox 78.0.1",
      "new_microsoft_edge": "Chromium Microsoft Edge 83.0.478.58",
      "ie": "Internet Explorer 11.900.18362.0",
      "mobile": {
        "chrome": "Mobile Chrome 83.0.4103.106"
      }
    },
    "1": {
      "title": "Home page available",
      "description": "The home page can be accessed via the navigation."
    },
    "2": {
      "title": "Concept page available",
      "description": "The concept page can be accessed via the navigation."
    },
    "3": {
      "title": "Timeline page available",
      "description": "The timeline page can be accessed via the navigation."
    },
    "4": {
      "title": "Licenses page available",
      "description": "The licenses page can be accessed via the navigation."
    },
    "5": {
      "title": "File formats page available",
      "description": "The file formats page can be accessed via the navigation."
    },
    "6": {
      "title": "Animations page available",
      "description": "The animation page can be accessed via the navigation."
    },
    "7": {
      "title": "Progressive web app page available",
      "description": "The progressive web app page can be accessed via the navigation."
    },
    "8": {
      "title": "Imprint page available",
      "description": "The imprint page can be accessed via the navigation."
    },
    "9": {
      "title": "Mockup page available",
      "description": "The mockup page can be accessed via the navigation."
    },
    "10": {
      "title": "Test page available",
      "description": "The test page can be accessed via the navigation."
    },
    "11": {
      "title": "Style guide page available",
      "description": "The Style Guide page can be accessed via the navigation."
    },
    "12": {
      "title": "Reflection page available",
      "description": "The reflection page can be accessed via the navigation."
    },
    "13": {
      "title": "Callable Github",
      "description": "Pressing Github in the navigation opens a new tab with the Github repository."
    },
    "14": {
      "title": "Home page responsive",
      "description": "The home page is completely responsive."
    },
    "15": {
      "title": "Concept page responsive",
      "description": "The concept page is completely responsive."
    },
    "16": {
      "title": "Timeline page responsive",
      "description": "The timeline page is completely responsive."
    },
    "17": {
      "title": "Licenses site responsive",
      "description": "The licenses page is completely responsive."
    },
    "18": {
      "title": "File formats page responsive",
      "description": "The file formats page is completely responsive."
    },
    "19": {
      "title": "Animations page responsive",
      "description": "The animation page is completely responsive."
    },
    "20": {
      "title": "Progressive web app page responsive",
      "description": "The progressive web app page is completely responsive."
    },
    "21": {
      "title": "Imprint Site responsive",
      "description": "The imprint page is completely responsive."
    },
    "22": {
      "title": "Mockup site responsive",
      "description": "The mockup page is completely responsive."
    },
    "23": {
      "title": "Test site responsively",
      "description": "The testing site is completely responsive."
    },
    "24": {
      "title": "Responsive style guide page",
      "description": "The Style Guide page is completely responsive."
    },
    "25": {
      "title": "Reflection side responsive",
      "description": "The reflection side is completely responsive."
    },
    "26": {
      "title": "Images and videos are all loaded",
      "description": "All images and videos on the pages are loaded."
    },
    "27": {
      "title": "Code can be opened",
      "description": "Code can be opened and closed on all sides."
    },
    "28": {
      "title": "Open navigation",
      "description": "Navigation can be opened on all pages."
    },
    "29": {
      "title": "PWA",
      "description": "The website can be installed as a PWA."
    }
  }
}
