{
  "language": {
    "english": "english",
    "german": "german"
  },
  "application": {
    "title": "M152",
    "nav": "navigation"
  },
  "general": {
    "translation-title": "Translation",
    "translation-description": "This application / website was written in German. All other languages that are available have not been translated by humans and may therefore contain translation errors."
  },
  "navigation": {
    "home": "home",
    "concept": "concept",
    "timeline": "timeline",
    "imprint": "imprint",
    "fileformats": "file formats",
    "animations": "animations",
    "github": "Github",
    "pwa": "progressive web app",
    "mockup": "mockup"
  },
  "owner": {
    "name": "Michael Baumberger",
    "address": "Via Calundis, 39",
    "city": "7013 Domat/Ems",
    "country": "Switzerland",
    "email": "michael_baumberger@gmx.ch",
    "instagram": {
      "description": "These are all pictures that I have taken myself. If you want to see more pictures of me, click on the link below.",
      "name": "michi_009"
    }
  },
  "impress": {
    "contact-address-title": "Contact address",
    "email-title": "E-mail:",
    "disclaimer-of-liability-title": "Disclaimer of liability",
    "disclaimer-of-liability-1": "The author assumes no liability for the correctness, accuracy, timeliness, reliability and completeness of the information.",
    "disclaimer-of-liability-2": "Liability claims against the author due to material or immaterial damage resulting from the access or use or non-use of the published information, misuse of the connection or technical faults are excluded.",
    "disclaimer-of-liability-3": "All offers are non-binding. The author expressly reserves the right to change, supplement or delete parts of the pages or the entire offer without special announcement or to temporarily or permanently cease publication.",
    "disclaimer-of-liability-for-links-title": "Disclaimer of liability for links",
    "disclaimer-of-liability-for-links": "References and links to third party websites are outside our area of responsibility. It rejected any responsibility for such websites. Accessing and using such websites is at the user's own risk.",
    "copyrights-title": "Copyrights",
    "copyrights": "The copyrights and all other rights to content, images, photos or other files on this website belong exclusively to the above-mentioned owner or the specifically named rights holder. The written consent of the copyright holder must be obtained in advance for the reproduction of any elements.",
    "source-title": "Source:",
    "source": "SwissAnwalt"
  },
  "file-formats": {
    "title": "File formats",
    "description": "Here is shown how to integrate different file formats in HTML5.",
    "video": {
      "title": "Video format",
      "description": "A video was integrated here. Below the video you can see the source code with which the video was integrated.",
      "mp4": "This is the source tag to include an MP4 that has been made.",
      "ogg": "This would be the source tag to include an ogg.",
      "webm": "This would be the source tag to include a webm.",
      "tag": "This is the video tag and the class 'p-justify-center' was used to center the video. The tag poster was used to include a preview image of the video. With 'autoplay =' autoplay ',' loop = 'true' the video is played automatically as soon as it has been loaded and it is repeated again and again."
    },
    "images": {
      "title": "Images",
      "description": "Here some image formats are presented and shown how images are integrated in HTML5.",
      "tag": "This is the tag to easily include an image."
    },
    "sound": {
      "title": "Music files",
      "description": "Here a music file was integrated in HTML5. Below it is shown how the file was integrated.",
      "tag": "audio: This is the tag to include an MP3 file.",
      "controls": "control: This must be set so that the user can run / stop playback and adjust the volume.",
      "src": "src: This is the tag to specify the source, i.e. the file.",
      "notCompatible": "This is displayed if a browser does not support music playback."
    }
  },
  "animations": {
    "title": "animations",
    "description": "Here is shown how different types of animations are made.",
    "css3": {
      "title": "CSS3 animations",
      "description": "Here is shown how CSS3 animations are made.",
      "letsGO": "Let's GOO!!"
    },
    "svg": {
      "title": "SVG animations",
      "description": "Here is shown how SVG animations are made."
    },
    "angular": {
      "title": "Angular animations",
      "description": "To see the Angular animation, click on the title of the website 'M152'. The code that is used is listed below."
    },
    "canvas": {
      "title": "HTML5 Canvas",
      "description": "Here a clock was integrated in HTML5 canvas.",
      "html-integration": "The canvas was defined in HTML.",
      "typescript-integration": "This is the typescript / javascript code used for the clock."
    }
  },
  "concept": {
    "title": "Concept",
    "idea": {
      "title": "Idea",
      "description": "The idea is that this is a website that documents how you do something, shows best practices, or explains differences between things."
    }
  },
  "calendar": {
    "settings": {
      "today": "today",
      "month": "month",
      "week": "week",
      "day": "day",
      "list": "list"
    },
    "entries": {
      "1": {
        "title": "input copyright"
      },
      "2": {
        "title": "website planing"
      },
      "3": {
        "title": "timeline created"
      },
      "4": {
        "title": "OneNote notes created"
      },
      "5": {
        "title": "Mockup drawed (by hand)"
      },
      "6": {
        "title": "input SVG"
      },
      "7": {
        "title": "website base frame created"
      },
      "8": {
        "title": "calendar for timeline created"
      },
      "9": {
        "title": "input ___"
      },
      "10": {
        "title": "made application server ready"
      },
      "11": {
        "title": "imprint created"
      },
      "12": {
        "title": "application first time deploied and buggs fixed"
      },
      "13": {
        "title": "timeline revised/refactored"
      },
      "14": {
        "title": "impress to english translated"
      },
      "15": {
        "title": "icons created"
      },
      "16": {
        "title": "file format page created"
      },
      "17": {
        "title": "file format video integrated"
      },
      "18": {
        "title": "file format images integrated"
      },
      "19": {
        "title": "file format sound integrated"
      },
      "20": {
        "title": "animations Angular integrated"
      },
      "21": {
        "title": "animations CSS3 integrated"
      },
      "22": {
        "title": "file format revised/refactored"
      },
      "23": {
        "title": "animationen SVG integrated"
      },
      "24": {
        "title": "animationen Angular integrated"
      },
      "25": {
        "title": "animationen HTML5 Canvas integrated"
      },
      "26": {
        "title": "Sound loading bug fixed"
      },
      "27": {
        "title": "button to show code integrated"
      },
      "28": {
        "title": "responsive except Canvas clock"
      },
      "29": {
        "title": "made to PWA (Progressiv Web App)"
      },
      "30": {
        "title": "calendar multilingual"
      },
      "31": {
        "title": "buggs fixed"
      },
      "32": {
        "title": "calendar on day click integrated"
      },
      "33": {
        "title": "calendar entries multilingual"
      },
      "34": {
        "title": "Mockup site created"
      }
    }
  },
  "pwa": {
    "title": "Progressive web app",
    "description": "A PWA (Progressive Web App) has numerous features that a native app also has. Progressive web apps are mostly built like a normal website, i.e. from HTML5, CSS3 and Javascript. Service workers ensure offline functionality by caching the page. The HTTPS protocol is mandatory for communication with the web server.",
    "functionality": {
      "title": "functionality",
      "description": "A progressive web app can be visited like any other website by calling up the URL. With the first call, a service worker is 'installed' in the browser. This caches all pages for which it is intended. There is a configuration file in which the developer can say what should be cached. To 'install' the website as an app, an icon is displayed in the address bar in the Chrome Desktop Browser. On the mobile phone there is usually a pop-up or a message at the bottom of the screen, which notifies you that the website can be added as an app.",
      "serviceworker": {
        "title": "Service worker",
        "description": "A service worker is a Javascript that runs in the browser in the background and provides functions such as caching for offline use."
      }
    },
    "characteristic": {
      "title": "Characteristic",
      "description": "In addition to the properties that a normal website provides, a progressive web app provides special functions that normally have native apps.",
      "installation": {
        "title": "Add-to homescreen / installability",
        "description": "A progressive web app can be added to the home screen using an 'add-to homescreen' function. A manifest file is used to define a splash screen or the icon of the app, for example."
      },
      "notification": {
        "title": "Push notifications",
        "description": "A progressive web app can display push notifications in its notification bar, which normally only native apps can do and no websites."
      },
      "offline": {
        "title": "Offline functionality",
        "description": "With the caching functionality provided by the service worker, the PWA can also be available offline. This is easy with a progressive web app without a backend, but there are some problems."
      }
    },
    "advantages": {
      "title": "advantages",
      "cost_reduction": {
        "title": "Cost reduction",
        "description": "Instead of several apps (Android, IOS, Windows and Web), a progressive web app only has to be developed once in one version. Another advantage is that Google or Apple does not deserve anything from in-app purchases."
      },
      "app_like": {
        "title": "App-like design",
        "description": "A good progressive web app has the same designs as a native app."
      },
      "hardware": {
        "title": "Hardware access",
        "description": "PWAs also offer the possibility of implementing various native functions. Sensor data and cameras can be accessed or push notifications can be created."
      },
      "release": {
        "title": "Simplified publication",
        "description": "Progressive web apps can go to the Google App Store, but don't have to go through the lengthy publishing process of Google Play, Windows Phone Apps or Apple's App Store."
      },
      "offline": {
        "title": "Offline mode",
        "description": "The Progressive Web App can also be made available offline by the service worker."
      },
      "performance": {
        "title": "Improved performance",
        "description": "PWAs are faster than common web apps. Conversions, user experience and retention rates benefit from this."
      }
    }
  },
  "mockup": {
    "title": "Mockup",
    "description": "Unfortunately, the creation of a mockup or rather a wireframe with a tool failed. There were several reasons for this. The tool, or rather the tools that I picked out, were very difficult to understand. Getting used to and creating the tool as a mockup in the desktop and mobile version would have taken far too much time. Another reason that only occurred to me after drawing was that I wanted to embed the mockup in the website and I don't know how I could embed a wireframe in a website. That's why I drew this mockup. The mobile version looks exactly the same, except of course that it is narrower.",
    "libraries": {
      "title": "libraries",
      "description": "I used a few libraries but always remembered that I don't do everything with libraries, because then I wouldn't have to do anything anymore. If I did everything with libraries, I could also use Wordpress, navigate here, click there, install this plugin, drag it there and set the maximum width. That would be WordPress. Linked below are all the libraries that I have used."
    },
    "others": {
      "title": "others",
      "description": "I used other tools for this. Some are for programming, version controll, others for provisioning on the server etc."
    }
  }
}
