{
  "language": {
    "english": "english",
    "german": "german"
  },
  "application": {
    "title": "M152",
    "nav": "navigation"
  },
  "general": {
    "translation-title": "Translation",
    "translation-description": "This application / website was written in German. All other languages that are available have not been translated by humans and may therefore contain translation errors."
  },
  "navigation": {
    "home": "home",
    "timeline": "timeline",
    "imprint": "imprint",
    "fileformats": "file formats",
    "animations": "animations"
  },
  "owner": {
    "name": "Michael Baumberger",
    "address": "Via Calundis, 39",
    "city": "7013 Domat/Ems",
    "country": "Switzerland",
    "email": "michael_baumberger@gmx.ch",
    "instagram": {
      "description": "These are all pictures that I have taken myself. If you want to see more pictures of me, click on the link below.",
      "name": "michi_009"
    }
  },
  "impress": {
    "contact-address-title": "Contact address",
    "email-title": "E-mail:",
    "disclaimer-of-liability-title": "Disclaimer of liability",
    "disclaimer-of-liability-1": "The author assumes no liability for the correctness, accuracy, timeliness, reliability and completeness of the information.",
    "disclaimer-of-liability-2": "Liability claims against the author due to material or immaterial damage resulting from the access or use or non-use of the published information, misuse of the connection or technical faults are excluded.",
    "disclaimer-of-liability-3": "All offers are non-binding. The author expressly reserves the right to change, supplement or delete parts of the pages or the entire offer without special announcement or to temporarily or permanently cease publication.",
    "disclaimer-of-liability-for-links-title": "Disclaimer of liability for links",
    "disclaimer-of-liability-for-links": "References and links to third party websites are outside our area of responsibility. It rejected any responsibility for such websites. Accessing and using such websites is at the user's own risk.",
    "copyrights-title": "Copyrights",
    "copyrights": "The copyrights and all other rights to content, images, photos or other files on this website belong exclusively to the above-mentioned owner or the specifically named rights holder. The written consent of the copyright holder must be obtained in advance for the reproduction of any elements.",
    "source-title": "Source:",
    "source": "SwissAnwalt"
  },
  "file-formats": {
    "title": "File formats",
    "description": "Here is shown how to integrate different file formats in HTML5.",
    "video": {
      "title": "Video format",
      "description": "A video was integrated here. Below the video you can see the source code with which the video was integrated.",
      "mp4": "This is the source tag to include an MP4 that has been made.",
      "ogg": "This would be the source tag to include an ogg.",
      "webm": "This would be the source tag to include a webm.",
      "tag": "This is the video tag and the class 'p-justify-center' was used to center the video. The tag poster was used to include a preview image of the video. With 'autoplay =' autoplay ',' loop = 'true' the video is played automatically as soon as it has been loaded and it is repeated again and again."
    },
    "images": {
      "title": "Images",
      "description": "Here some image formats are presented and shown how images are integrated in HTML5.",
      "tag": "This is the tag to easily include an image."
    },
    "sound": {
      "title": "Music files",
      "description": "Here a music file was integrated in HTML5. Below it is shown how the file was integrated.",
      "tag": "This is the tag to include an MP3 file.",
      "controls": "This must be set so that the user can run / stop playback and adjust the volume.",
      "src": "This is the tag to specify the source, i.e. the file.",
      "notCompatible": "This is displayed if a browser does not support music playback."
    }
  }
}
